Revit 2027 API
Curve.SetGraphicsStyleId Method
Sets the graphics style id for this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGraphicsStyleId(
	ElementId id
)
Public Sub SetGraphicsStyleId (
	id As ElementId
)
public:
void SetGraphicsStyleId(
	ElementId^ id
)
member SetGraphicsStyleId :
        id : ElementId -> unit
Parameters
id ElementId
The id of the GraphicsStyle element from which to apply the curve properties.
Remarks
If the curve is marked as read-only (because it was extracted directly from a Revit element or collection/aggregation object), calling this method causes the object to be changed to carry a disconnected copy of the original curve. The modification will not affect the original curve or the object that supplied it.
Many methods in the Revit API will not use the graphics style associated to this curve. For example, curves used as portions of the sketch of an element will not read this property. Newly created curve elements will not use this value either, as they inherit their graphical properties from their associated category.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace